//здесь я буду проверять разные эксперименты и запечатлять их

#include "game.h"

//11.12 
//--------------------------------------------------------------

// уже есть идея как писать , записываю сюда, а то забуду, создать класс, где будет доска, и еще енум класс для игроков (крестик , нолик, пустота)
//--------------------------------------------------------------

//12.12 
//--------------------------------------------------------------

//идея про структуры

/*int main()
{
    std::cout << "○" << "\n";

    std::cout << "×" << "\n";

    return 0;
}*/

//придется латиницей писать (
//--------------------------------------------------------------

//14.12
//--------------------------------------------------------------

//закинул  сюда часть кода , которую ты начала писать 

/*bool expContinue(std::string expression) {
    if() {

    }
}*/

/*void game::Tictactoe::printboard()
{
    for(size_t i = 0; i != size; i++)
    {
        for(size_t j = 0; j != size; j++)
        {
            
        }
    }
}*/

//-----------------------------------------------------